{"pageProps":{"post":{"title":"The dream of a Ridiculous Man","slug":"the_dream_of_ridiculous_man","content":"<nav class=\"toc\"><ol class=\"toc-level toc-level-1\"><li class=\"toc-item toc-item-h2\"><a class=\"toc-link toc-link-h2\" href=\"#plot\">Plot</a></li><li class=\"toc-item toc-item-h2\"><a class=\"toc-link toc-link-h2\" href=\"#themes\">Themes</a></li></ol></nav><h2 id=\"plot\">Plot</h2>\n<p>\"The dream of a Ridiculous Man\" by Fyodor Dostoevsky is about a man contemplating the bizarre nature of his life. Upon the relalization that nothing matters anymore he comes up with the idea of suicide. He had bought a revolver 6 months ago, and he intends to use it later that night.</p>\n<p>While walking down the streets of St. Petersburg he encounters a girl seeking his help. Although, he can not quite hear what she is saying because of her trembling voice, he understands that her mother might be in danger. He dismisses her, and when she persists, he shouts and stamp his foot against her.</p>\n<p>When he gets back to his apartment, he sinks into a chair and places the revolver in front of him on the table. However, since the encounter with the girl he has been plagued by pity because of the way he behaved against her. He should not worry since he has already decided that nothing matters anymore and that he soon will leave this world. While confident that he still will commit suicide that night he falls into a dream.</p>\n<p>He decends into a dream where he shoots himself but feel no pain. Still aware of his surroundings, he attends a funeral. He figures out it must be his funeral. Suddenly a figure pulls him up from the grave and the two fly into space. They arrive at a planet very similar to earth. The planet turns out to be some kind of utopia where people are free from suffering.</p>\n<p>He lives in their world for a long time, but one day he accidentally teaches the people to lie. From that moment the world is corrupted. What once was an utopia is now filled with jealousy, cruelty and shame. The people forget their former happiness. They tell him</p>\n<blockquote>\n<p>\"We have science, and with its help we shall again find the truth, but now we shall accept it consciusly. Knowledge is higher than feeling, consciousness of life is higher than life... a knowledge of the laws of happiness is higher than happiness.\"</p>\n</blockquote>\n<p>He wants the people to punish him for what he has done, but they just laugh at the ridiculuous man. When sorrow enters his soul he abruptly awakes. Once he realized that he is awake he shines up in amazement. He reaches for the gun, but he is a changed man now, and pushes the gun away. He is convinced of the goodness and potential for limitless love and decides to dedicate his life to achieve this goal.</p>\n<h2 id=\"themes\">Themes</h2>\n<ol>\n<li>Indifference to everything in the world.</li>\n<li>The eccentric (ridiculous) main character that no one understands.</li>\n<li>The hours before death is prevalent in many Dostoevsky's work. This short story is no exception. In this story the main character has to tackle the afterthoughts of his rudeness in the encounter with the little girl. As he already sees himself as a dead man, he also considers himself to be outside the normal expectations of everyday life. See <a href=\"https://en.wikipedia.org/wiki/Ethical_solipsism\">ethical solipism</a>.</li>\n<li>The idea of utopia as a power of unconditioned love for each other.</li>\n<li>The dream as a means from above.</li>\n<li>The instantaneous change as he was enlighted from the dream.</li>\n</ol>"}},"__N_SSG":true}